
## Plan Result (sandbox)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 17 to add, 0 to change, 17 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.POSTGRES-PASS-V14
  * azurerm_key_vault_secret.POSTGRES-USER-V14
  * azurerm_key_vault_secret.POSTGRES_DATABASE-V14
  * azurerm_key_vault_secret.POSTGRES_HOST-V14
  * azurerm_key_vault_secret.POSTGRES_PORT-V14
  * module.plum-redis-storage.azurerm_private_endpoint.this[0]
  * module.plum-redis-storage.azurerm_redis_cache.redis
  * module.plum-redis-storage.azurerm_resource_group.cache-resourcegroup[0]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;plum&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;rhubarb&#34;]
  * module.postgresql_flexible.azurerm_resource_group.rg[0]
  * module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs[&#34;plum&#34;]
  * module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs[&#34;rhubarb&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-V14 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES-PASS-V14" {
      ~ id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-PASS-v14/09a2961cf8c3487dadd5a4c85650a17f" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox" -> "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/plum-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/plumsi-sandbox" # forces replacement
        name                    = "recipe-backend-POSTGRES-PASS-v14"
      ~ resource_id             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-PASS-v14/versions/09a2961cf8c3487dadd5a4c85650a17f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-PASS-v14" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "09a2961cf8c3487dadd5a4c85650a17f" -> (known after apply)
      ~ versionless_id          = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-PASS-v14" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V14 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES-USER-V14" {
      ~ id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-USER-v14/8120c2cf7e42406a9851860d67d6ea32" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox" -> "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/plum-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/plumsi-sandbox" # forces replacement
        name                    = "recipe-backend-POSTGRES-USER-v14"
      ~ resource_id             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-USER-v14/versions/8120c2cf7e42406a9851860d67d6ea32" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-USER-v14" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "8120c2cf7e42406a9851860d67d6ea32" -> (known after apply)
      ~ versionless_id          = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-USER-v14" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-V14 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-V14" {
      ~ id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-DATABASE-V14/80466c365a504d60a37f0e5fe15692c5" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox" -> "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/plum-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/plumsi-sandbox" # forces replacement
        name                    = "recipe-backend-POSTGRES-DATABASE-V14"
      ~ resource_id             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-DATABASE-V14/versions/80466c365a504d60a37f0e5fe15692c5" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-DATABASE-V14" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "80466c365a504d60a37f0e5fe15692c5" -> (known after apply)
      ~ versionless_id          = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-DATABASE-V14" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-V14 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_HOST-V14" {
      ~ id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-HOST-V14/5b23524840694feda32359f8be344fbe" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox" -> "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/plum-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/plumsi-sandbox" # forces replacement
        name                    = "recipe-backend-POSTGRES-HOST-V14"
      ~ resource_id             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-HOST-V14/versions/5b23524840694feda32359f8be344fbe" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-HOST-V14" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      - value_wo_version        = 0 -> null
      ~ version                 = "5b23524840694feda32359f8be344fbe" -> (known after apply)
      ~ versionless_id          = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-HOST-V14" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-V14 must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_PORT-V14" {
      ~ id                      = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-PORT-V14/982d1a143e4343c28f8618af5f203e66" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox" -> "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/plum-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/plumsi-sandbox" # forces replacement
        name                    = "recipe-backend-POSTGRES-PORT-V14"
      ~ resource_id             = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-PORT-V14/versions/982d1a143e4343c28f8618af5f203e66" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox/secrets/recipe-backend-POSTGRES-PORT-V14" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "982d1a143e4343c28f8618af5f203e66" -> (known after apply)
      ~ versionless_id          = "https://crumblesi-sandbox.vault.azure.net/secrets/recipe-backend-POSTGRES-PORT-V14" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.plum-redis-storage.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox" -> (known after apply)
      ~ name                          = "crumble-recipe-backend-session-storage-sandbox" -> "plum-recipe-backend-session-storage-sandbox" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/networkInterfaces/crumble-recipe-backend-session-storage-sand.nic.856027a2-7042-42c3-b359-c92acc1f9760"
              - name = "crumble-recipe-backend-session-storage-sand.nic.856027a2-7042-42c3-b359-c92acc1f9760"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "crumble-recipe-backend-session-storage-sandbox.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.100.136.5",
                        ]
                      - name         = "crumble-recipe-backend-session-storage-sandbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name           = "crumble-recipe-backend-session-storage-cache-sandbox" -> "plum-recipe-backend-session-storage-cache-sandbox" # forces replacement
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                              = "crumble-recipe-backend-session-storage-sandbox" -> "plum-recipe-backend-session-storage-sandbox" # forces replacement
          ~ private_connection_resource_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.100.136.5" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.plum-redis-storage.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                             = "C" -> "P"
      ~ hostname                           = "crumble-recipe-backend-session-storage-sandbox.redis.cache.windows.net" -> (known after apply)
      ~ id                                 = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox" -> (known after apply)
      ~ name                               = "crumble-recipe-backend-session-storage-sandbox" -> "plum-recipe-backend-session-storage-sandbox" # forces replacement
      ~ port                               = 6379 -> (known after apply)
      ~ primary_access_key                 = (sensitive value)
      ~ primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      ~ redis_version                      = "6.0" -> "6"
      ~ replicas_per_master                = 0 -> (known after apply)
      ~ replicas_per_primary               = 0 -> (known after apply)
      ~ resource_group_name                = "crumble-recipe-backend-session-storage-cache-sandbox" -> "plum-recipe-backend-session-storage-cache-sandbox" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      ~ secondary_connection_string        = (sensitive value)
      - shard_count                        = 0 -> null
      ~ sku_name                           = "Basic" -> "Premium"
      ~ ssl_port                           = 6380 -> (known after apply)
        tags                               = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
      - tenant_settings                    = {} -> null
      - zones                              = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 1000 -> (known after apply)
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (9 unchanged attributes hidden)
        }
    }

  # module.plum-redis-storage.azurerm_resource_group.cache-resourcegroup[0] must be replaced
-/+ resource "azurerm_resource_group" "cache-resourcegroup" {
      ~ id         = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox" -> (known after apply)
      ~ name       = "crumble-recipe-backend-session-storage-cache-sandbox" -> "plum-recipe-backend-session-storage-cache-sandbox" # forces replacement
        tags       = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (2 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_password_wo_version = 0 -> null
      ~ fqdn                              = "crumble-v14-flexible-sandbox.postgres.database.azure.com" -> (known after apply)
      ~ id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox" -> (known after apply)
      ~ name                              = "crumble-v14-flexible-sandbox" -> "plum-v14-flexible-sandbox" # forces replacement
      ~ resource_group_name               = "crumble-v14-flexible-data-sandbox" -> "plum-v14-flexible-data-sandbox" # forces replacement
      ~ storage_tier                      = "P6" -> (known after apply)
        tags                              = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
      - zone                              = "1" -> null
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ resource_group_name = "crumble-v14-flexible-data-sandbox" -> "plum-v14-flexible-data-sandbox" # forces replacement
      ~ server_name         = "crumble-v14-flexible-sandbox" -> "plum-v14-flexible-sandbox" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      ~ id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox/administrators/0292f26e-288e-4f5b-85fc-b99a53f0a2b1" -> (known after apply)
      ~ resource_group_name = "crumble-v14-flexible-data-sandbox" -> "plum-v14-flexible-data-sandbox" # forces replacement
      ~ server_name         = "crumble-v14-flexible-sandbox" -> "plum-v14-flexible-sandbox" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["plum"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox/databases/plum" -> (known after apply)
        name      = "plum"
      ~ server_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["rhubarb"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox/databases/rhubarb" -> (known after apply)
        name      = "rhubarb"
      ~ server_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_resource_group.rg[0] must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id         = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox" -> (known after apply)
      ~ name       = "crumble-v14-flexible-data-sandbox" -> "plum-v14-flexible-data-sandbox" # forces replacement
        tags       = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (2 unchanged attributes hidden)
    }

  # module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs["plum"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "8292648225038589922" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "crumble-v14-flexible" -> "plum-v14-flexible"
            # (3 unchanged elements hidden)
        }
    }

  # module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs["rhubarb"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "3890378768757650480" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "crumble-v14-flexible" -> "plum-v14-flexible"
            # (3 unchanged elements hidden)
        }
    }

Plan: 17 to add, 0 to change, 17 to destroy.

Changes to Outputs:
  ~ api_gateway_url = "https://core-api-mgmt-sandbox.azure-api.net/crumble-recipes-api" -> "https://core-api-mgmt-sandbox.azure-api.net/plum-recipes-api"
  ~ vaultName       = "crumblesi-sandbox" -> "plumsi-sandbox"
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1231,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->